#pragma once

typedef struct Card_ {
	char ID[13];			// 卡号 13
	char password[7];		// 密码 7
	bool isLocked;			// 标记卡片是否被锁 1
	int balance;			// 卡内余额 4  共25
} Card;


/*Cards.dat 十六进制文件解析
卡的总数（4位）		05 00 00 00

【第一张卡】
卡号	（13位）		36 32 31 32 32 36 32 30 30 32 30 35 00
密码	（7位）		35 35 35 39 31 39 00
isLocked（1位）	00 cc cc cc 
balance（4位）	a0 8c 00 00 

【第二张卡】
卡号	（13位）		36 32 31 32 32 36 32 30 30 32 30 31 00
密码	（7位）		38 39 32 30 30 37 00
isLocked（1位）	00 cc cc cc
balance（4位）	50 14 00 00

【第三张卡】
卡号	（13位）		36 32 31 32 32 36 32 30 30 32 30 32 00
密码	（7位）		33 34 35 39 39 38 00
isLocked（1位）	00 cc cc cc
balance（4位）	40 1f 00 00

【第四张卡】
卡号	（13位）		36 32 31 32 32 36 32 30 30 32 30 33 00
密码	（7位）		37 38 38 31 32 33 00
isLocked（1位）	00 cc cc cc
balance（4位）	20 4e 00 00 

【第五张卡】
卡号	（13位）		36 32 31 32 32 36 32 30 30 32 30 34 00
密码	（7位）		30 39 30 38 33 37 00
isLocked（1位）	00 cc cc cc
balance（4位）	45 06 00 00
*/

/*ATM.dat 十六进制文件解析
balance（4位）	20 4e 00 00
*/